# Задание-1: уравнение прямой вида y = kx + b задано в виде строки.
# Определить координату y точки с заданной координатой x.
# вычислите и выведите y

equation = 'y = -12x + 11111140.2121'
x = 2.5

k = int(equation[4:7])
b = float(equation[-13:])

y = k * x + b

print(y)



